<a href="https://colab.research.google.com/github/jamesmattluyon/CpE-AIML/blob/main/58034_LabNo_01_BreananAndFriends.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Topic 01: Software Engineering Concepts Review
$_{\text{©D.J. Lopez | 2021 | Fudamentals of Machine Learning}}$

Data Science or Machine Learning is more than math or business application. It is also important to remember that AI, ML, or DS are being integrated into industry and companies for product delivery. So it is important to keep code clean, manage your files properly, and also assure readability for your projects and their codes.
This module is dedicated to reviewing the concepts of software engineering and integrating their concepts in Machine Learning programming. For this notebook we will be covering:
* Modular Programming
* Object-oriented Programming Concepts
* Documentation
* Version Control

# 1. Modular Programming
Creating readable and understandable code is needed in the industry or any project that you might do. It does not just benefit yourself in understanding your code or project but also other teams, users, and even future researchers. In this module, we are going to discuss how to format your projects and codes for readability and understandability. One of the techniques to achieve this is through modular programming.

The idea of modular programming is to make your code granular for reusability. It does not only makes your code simpler but also optimal. The goal of making your code more efficient does not only look into visual representation but also its optimization.

## 1.1 Refactoring

Refactoring your code means restructuring your code without changing the expected output. We consider code refactoring while optimizing our code in terms of naming or even in optimizing methods. The first activity of refactoring that we will do or consider is renaming and the other is "functionizing" your code.

### *Renaming*

You might think discussing this topic must be pointless or too simplistic but it is actually one of the most frequent mistakes that data scientists, professors, or researchers usually do. Naming variables and functions properly will bring clarity to understanding the code.

In [ ]:
'''
    CASE 1: Setting the class grades.

    The case for this section would be computing for the grades of a 
    certain class. For the next cells will be looking in how can we create a 
    class analytics implementation.
'''
### Example of bad naming in module import nicknames.
### Nicknames should be short and still relevant to the module.

# import pandas as food_panda 
## bad, since not representative and long
#import pandas as nd 
##bad, although short it is not representative
import pandas as pd 
##good, aside form community acceptance it is short and representative

ln = ["Ingles", "Español", "Cruz", "Jones"]
# bad, since "ln" is ambiguous.

names = ["Ingles", "Español", "Cruz", "Jones"] 
# good, since descriptive

lnames = ["Ingles", "Español", "Cruz", "Jones"]
# better, more specific that itis about last names

last_names_of_the_class = ["Ingles", "Español", "Cruz", "Jones"] 
# bad, too long

### Task 1: Setting the Class Grades
1. Create variable declarations for:
        - Last Names
        - First Names
        - Grades for Prelims
        - Grades for Midterms
        - Grades for Finals 
2. Create a DataFrame (Pandas) for consolidating the data from Task 1.1

In [1]:
### CODE HERE ###
import pandas as pd 

nanfriends = {
    'lnames': ['Catibog','Gonzalez','Luyon','Reyes','Tonquin'],
    'fnames': ['Jan Irene','Andrea Jean','James Matthew','Carl Vincent','John Brenan'],
    'prelim': [89, 84, 85, 86, 87],
    'midterm': [88, 89, 90, 91, 92],
    'finals': [93, 94, 95, 96, 97]
}
df = pd.DataFrame(nanfriends)
df

     lnames         fnames  prelim  midterm  finals
0   Catibog      Jan Irene      89       88      93
1  Gonzalez    Andrea Jean      84       89      94
2     Luyon  James Matthew      85       90      95
3     Reyes   Carl Vincent      86       91      96
4   Tonquin    John Brenan      87       92      97

In [ ]:
# import pandas as pd
# import io
# from google.colab import files
# uploaded = files.upload()

# classgrades_df = pd.read_csv('\class_grades.csv')

In [2]:
pd.set_option('display.max_columns', 27)
pd.set_option('display.max_rows', 27)

In [3]:
import pandas as pd
classgrade_df = pd.read_csv(r'/content/sample_data/class_grades.csv')
classgrade_df.head(10)

      name  id  prelim_grades  midterm_grades  final_grades
0    alpha   1      94.960000          95.260       92.2192
1    aleph   2      94.960000          95.260       92.7792
2     beta   3      78.173333          94.360       84.3200
3     beth   4      78.173333          81.372       84.6400
4   cuprum   5      94.960000          95.260       92.2192
5    delta   6      84.826667          92.485       83.5792
6      eta   7      93.980000          97.300       95.6528
7  epsilon   8      60.788200          68.000       83.8672
8  foxtrot   9      94.306667          82.000       84.1472
9    gamma  10      96.406667          82.000       84.1472

In [4]:
classgrades_df = classgrade_df.fillna(0)
classgrades_df

       name  id  prelim_grades  midterm_grades  final_grades
0     alpha   1      94.960000          95.260       92.2192
1     aleph   2      94.960000          95.260       92.7792
2      beta   3      78.173333          94.360       84.3200
3      beth   4      78.173333          81.372       84.6400
4    cuprum   5      94.960000          95.260       92.2192
5     delta   6      84.826667          92.485       83.5792
6       eta   7      93.980000          97.300       95.6528
7   epsilon   8      60.788200          68.000       83.8672
8   foxtrot   9      94.306667          82.000       84.1472
9     gamma  10      96.406667          82.000       84.1472
10     geld  11      86.926667          92.485       82.7792
11    horus  12      78.173333          94.360       84.3200
12     iota  13      94.306667          82.000       84.1472
13     ixus  14      78.173333          94.360       84.3200
14  jakarta  15      84.826667          92.485       82.7792
15    koppa  16       0.000000          87.685       83.8672
16   lambda  17      93.980000          97.300       95.6528
17       mu  18      79.806667          83.500       81.2792
18       nu  19      75.406667          82.000       82.5472
19     neta  20      69.314000          87.685       50.3360
20  omicron  21      93.980000          97.300       95.6528
21    omega  22      79.806667          83.500       81.2792
22  phalanx  23      84.826667          92.485       82.7792
23     peta  24      94.960000          95.260       92.2192
24       pi  25      79.806667          87.460       81.2792
25    yotta  26      93.980000          97.300       94.8528
26     zeta  27      86.626667          84.850       83.8672

### *Code Reusability*

Just like in any writing we want to reduce redundancies in our content. Just like following the rules of brevity we also consider that in creating cleaner code. One way of applying brevity to code is code reusability wherein you refrain from creating code that you repeat in encoding. This is where the use of functions will be most used. Consider the following code below.

In [ ]:
'''
    CASE 2: Computing grades.

    For this cell we are going to look into creating functions for the class.
    This includes computing for their grades and some classroom management
    routines.
'''
### Consider this procedural programming script
gs_1 = [89.4, 78.2, 88.0, 28.5, 67.3]
# Get average grades of the class
class_g = 0
for g in gs_1:
  class_g += g
cmean = class_g/len(gs_1)
print(cmean)

70.28

In [ ]:
### Now let's say you want to reuse the code above for a different class
### you might just copy and paste in like the code below and change some 
### variable naming

gs_2 = [99.4, 64.5, 87.2, 68.5, 57.]
# Get average grades of the class
class_g = 0
for g in gs_2:
  class_g += g
cmean = class_g/len(gs_2)
print(cmean)

75.34

In [ ]:
### That works but if you keep doing that for production, it would just look
### like spaghetti code. Instead, if you are repeating code, consider creating
### a function.

def average(grades):
  grades_class = 0
  for g in grades:
    grades_class += g
  avg = grades_class/len(grades)
  return avg

In [ ]:
### The code above would be reusable but it is not easy to read. We need to 
### enforce the code refactoring for renaming not just the variables but also
### the functions we are creating. So if we would refactor the 'average' 
### Function earlier it could be:

def get_class_ave(arr):
  class_grades = 0
  for grade in arr:
    class_grades += grade
  class_avg = class_grades/len(arr)
  return class_avg

### Task 2: Getting Class Statistics
1. Create a function named `get_grades()` for computing the semestral grade of each student:

  `inputs`: `DataFrame` of a class grade sheet.
  
  `outpus`: `DataFrame` showing:
  * The prelim, midterms, and finals grades of each student
  * The semestral grade of each student

2. Create a function named `get_class_stats()`.
  
  `inputs`: `DataFrame` from `get_grades()`.
  
  `outpus`: `DataFrame` showing:
  * The lowest and highest prelim, midterm, finals, and semestral grades
  * the mean, median, mode, and standard deviation of the grades

In [ ]:
### CODE HERE ###
def get_grades1(df):
  for ind, row in df.iterrows():
    df.loc[ind,"semestral_grades"] = row['prelim_grades'] * 0.3 + row['midterm_grades'] * 0.3 + row['final_grades'] * 0.4
  return df.loc

get_grades1(classgrades_df)
classgrades_df.head(5)

     name  id  prelim_grades  midterm_grades  final_grades  semestral_grades
0   alpha   1      94.960000          95.260       92.2192          93.95368
1   aleph   2      94.960000          95.260       92.7792          94.17768
2    beta   3      78.173333          94.360       84.3200          85.48800
3    beth   4      78.173333          81.372       84.6400          81.71960
4  cuprum   5      94.960000          95.260       92.2192          93.95368

In [5]:
def get_grades(df):
  prelim = df["prelim_grades"]
  midterm = df["midterm_grades"]
  finals = df["final_grades"]
  for string in df["name"]:
    sem_grades = prelim * 0.3 + midterm * 0.3 + finals * 0.4
    df["semestral_grades"] = sem_grades
  return df

In [6]:
get_grades(classgrades_df)
classgrades_df

       name  id  prelim_grades  midterm_grades  final_grades  semestral_grades
0     alpha   1      94.960000          95.260       92.2192          93.95368
1     aleph   2      94.960000          95.260       92.7792          94.17768
2      beta   3      78.173333          94.360       84.3200          85.48800
3      beth   4      78.173333          81.372       84.6400          81.71960
4    cuprum   5      94.960000          95.260       92.2192          93.95368
5     delta   6      84.826667          92.485       83.5792          86.62518
6       eta   7      93.980000          97.300       95.6528          95.64512
7   epsilon   8      60.788200          68.000       83.8672          72.18334
8   foxtrot   9      94.306667          82.000       84.1472          86.55088
9     gamma  10      96.406667          82.000       84.1472          87.18088
10     geld  11      86.926667          92.485       82.7792          86.93518
11    horus  12      78.173333          94.360       84.3200          85.48800
12     iota  13      94.306667          82.000       84.1472          86.55088
13     ixus  14      78.173333          94.360       84.3200          85.48800
14  jakarta  15      84.826667          92.485       82.7792          86.30518
15    koppa  16       0.000000          87.685       83.8672          59.85238
16   lambda  17      93.980000          97.300       95.6528          95.64512
17       mu  18      79.806667          83.500       81.2792          81.50368
18       nu  19      75.406667          82.000       82.5472          80.24088
19     neta  20      69.314000          87.685       50.3360          67.23410
20  omicron  21      93.980000          97.300       95.6528          95.64512
21    omega  22      79.806667          83.500       81.2792          81.50368
22  phalanx  23      84.826667          92.485       82.7792          86.30518
23     peta  24      94.960000          95.260       92.2192          93.95368
24       pi  25      79.806667          87.460       81.2792          82.69168
25    yotta  26      93.980000          97.300       94.8528          95.32512
26     zeta  27      86.626667          84.850       83.8672          84.98988

In [7]:
def get_class_stats(df):
  prelim = df["prelim_grades"]
  midterm = df["midterm_grades"]
  finals = df["final_grades"]
  sem_grade = df["semestral_grades"]

  p_mean = prelim.mean()
  p_median = prelim.median()
  p_mode = prelim.mode()[0]
  p_std = prelim.std()
  p_lowest = prelim.min()
  p_highest = prelim.max()

  m_mean =  midterm.mean()
  m_median =  midterm.median()
  m_mode =  midterm.mode()[0]
  m_std =  midterm.std()
  m_lowest = midterm.min()
  m_highest = midterm.max()

  f_mean = finals.mean()
  f_median = finals.median()
  f_mode = finals.mode()[0]
  f_std = finals.std()
  f_lowest = finals.min()
  f_highest = finals.max()

  s_mean = sem_grade.mean()
  s_median = sem_grade.median()
  s_mode = sem_grade.mode()[0]
  s_std = sem_grade.std()
  s_lowest = sem_grade.min()
  s_highest = sem_grade.max()

  classStats = {' ':["Prelim Grades","Midterm Grades","Final Grades","Semestral Grades"],
        'Lowest':[p_lowest,m_lowest,f_lowest,s_lowest],
        'Highest':[p_highest,m_highest,f_highest,s_highest],
        'Mean':[p_mean,m_mean,f_mean,s_mean],
        'Median':[p_median,m_median,f_median,s_median],
        'Mode':[p_mode,m_mode,f_mode,s_mode],
        'Standard_Deviation':[p_std,m_std,f_std,s_std]
  }
  df = pd.DataFrame(classStats)
  return df

In [8]:
get_class_stats(get_grades(classgrade_df))

,,Lowest,Highest,Mean,Median,Mode,Standard_Deviation
0,Prelim Grades,60.7882,96.406667,85.632136,85.726667,78.173333,9.402949
1,Midterm Grades,68.0000,97.300000,89.456000,92.485000,82.000000,7.179578
2,Final Grades,50.3360,95.652800,85.241807,84.147200,81.279200,8.607503
3,Semestral Grades,67.2341,95.645120,86.664746,86.428030,85.488000,7.106049

In [9]:
classgrade_df.describe()

,id,prelim_grades,midterm_grades,final_grades,semestral_grades
count,27.000000,26.000000,27.000000,27.000000,26.000000
mean,14.000000,85.632136,89.456000,85.241807,86.664746
std,7.937254,9.402949,7.179578,8.607503,7.106049
min,1.000000,60.788200,68.000000,50.336000,67.234100
25%,7.500000,78.581667,83.500000,82.779200,83.266230
50%,14.000000,85.726667,92.485000,84.147200,86.428030
75%,20.500000,94.225000,95.260000,92.219200,93.953680
max,27.000000,96.406667,97.300000,95.652800,95.645120

## 1.2 Code Optimization

When we consider your code to be part of production or for customer delivery we must consider that they are not laggy nor too space-consuming for devices. This is a common practice in data science and machine learning wherein training algorithms take up resources from computers or considering the space a model consumes at your workspace or your customer’s device.

### *Space Complexity*

This would specifically refer to your choice of data structures. This is a job for reviewing data structures and algorithms for space complexity. Although in Python for AI we are looking into more data structures like matrices and data frames.

In [ ]:
'''
    CASE 3: Class management.

    For this cell we are going to look into optimizing functions for the class.
    This includes finding unique data and similar data amnong class materials.
'''
## The following code will optimize how to efficiently store data into memory
enrollees_2016_2020 = ['15022', '18302', '8845', '9203', '10035']
enrollees_2016_2020 = [15022, 18302, 8845, 9203, 10035]

In [ ]:
img1 = [[125.4543, 254.0001], [64.2132, 84.5336]]
img1

[[125.4543, 254.0001], [64.2132, 84.5336]]

In [ ]:
import numpy as np
img1_vector = np.array(img1)
img1_vector

array([[125.4543, 254.0001],
       [ 64.2132,  84.5336]])

In [ ]:
img1_quantized = np.array(img1_vector, dtype='int32')
img1_quantized

array([[125, 254],
       [ 64,  84]], dtype=int32)

### *Time Complexity*

If you would recall back in your data structures and algorithms this pertains to the Big-O notation. However, in this notebook, we’ll look into specific and intuitive samples of time complexity. We are going to look at specific AI use such as the concept of vectorization.

In [ ]:
## The following code wil try to optimize getting unique elements from the given
## list of class codes

curr_2018_courses = ['220', '270', '318', '450', '101', '768', '223L', '223',
                     '727', '418', '673', '672', '450', '124', '771', '654',
                     '231', '768', '768', '224', '654', '673']
### print an array that shows only the unique elements
### Code from Geeks for Geeks
def unique(arr):
     # initialize a null list
    unique_list = []
     
    # traverse for all elements
    for item in arr:
        # check if exists in unique_list or not
        if item not in unique_list:
            unique_list.append(item)
    return sorted(unique_list)

unique(curr_2018_courses)

In [ ]:
### Optimized way
sorted(list(set(curr_2018_courses)))

In [ ]:
### Optimizing Functions
import math
def get_floor_binlog(num):
  return math.floor(math.log2(num))
get_floor_binlog(31)

4

In [ ]:
### Lambda Functions
binlog = lambda num: math.floor(math.log2(num))
binlog(31)

4

In [ ]:
### Optimizing Booleans
val = 1
if val%2 == 0:
  val = 1
else:
  val = 2

In [ ]:
### Singe-line Boolean Statemets
val = 1
val = 1 if val%2 == 0 else 2
val

2

In [ ]:
### Optimizing Iterations
bits = [1,0,1,1,1]
not_bits = []
for bit in bits:
  not_bits.append(int(not(bit)))
print(not_bits)

[0, 1, 0, 0, 0]

In [ ]:
### List Comprehensions
bits = [1,0,1,0,1]
not_bits = [int(not(bit)) for bit in bits]
not_bits

[0, 1, 0, 1, 0]

In [ ]:
### A Networks Example
def get_floor_binlog(num):
  return math.floor(math.log2(num))
def get_subnet_bits(user_count):
  
  floor_bin = get_floor_binlog(user_count) # gets the floor bits from 
                                           # the user count
  if floor_bin == 0: # assign 1 if bit count is 0.
    floor_bin = 1
  bits = [] # instantiate the bit container
  for i in range(floor_bin): # add a bit to the list of bits according to the
                             # bit count.
    bits.append(1) 
  return bits

get_subnet_bits(32)

[1, 1, 1, 1, 1]

In [ ]:
#### An Optimized Networks Example
floor_bin = lambda num: math.floor(math.log2(num))

def get_subnet_bits(user_count):
  
  nbits = floor_bin(user_count) # gets the floor bits from the user count
  nbits = 1 if nbits==0 else nbits # assign 1 if bit count is 0.
  bits = [1 for i in range(nbits)] # add a bit to the list of bits according 
                                   # to the bit count.
  return bits

get_subnet_bits(32)

[1, 1, 1, 1, 1]

In [ ]:
## The following code wil try to optimize solving for the inner product of two
## lists
vectA = [1,2,3,1,-1,2]
vectB = [-1,4,5,3,2,0]

In [ ]:
def inner_product(vect1, vect2):
  result = 0 
  for va,vb in zip(vectA, vectB):
    result += va*vb
  return result
inner_product(vectA, vectB)

23

In [ ]:
## Optimized method
np.array(vectA) @ np.array(vectB)

23

### Task 3: Advanced Class Functions
1. Optimize `get_grades()` by eliminating for loops in your function.
2. Create a function named `get_similar_students()`
  
  `inputs`: two (2) class `DataFrames`
  
  `outputs`: list of common student numbers.

  *Note*: The function should not contain iterative code blocks (i.e. `for` or `while` loops, or list comprehension)

In [44]:
### CODE HERE ###

newclassgrade_df = pd.read_excel(r'/content/sample_data/class_grades.xlsx')
newclassgrade_df.head(5)

     name  id  prelim_grades  midterm_grades  final_grades
0   alpha   1      94.960000          95.260       92.2192
1   aleph   2      94.960000          95.260       92.7792
2    beta   3      78.173333          94.360       84.3200
3    beth   4      78.173333          81.372       84.6400
4  cuprum   5      94.960000          95.260       92.2192

In [45]:
newclassgrades_df = newclassgrade_df.fillna(0)
newclassgrades_df

       name  id  prelim_grades  midterm_grades  final_grades
0     alpha   1      94.960000          95.260       92.2192
1     aleph   2      94.960000          95.260       92.7792
2      beta   3      78.173333          94.360       84.3200
3      beth   4      78.173333          81.372       84.6400
4    cuprum   5      94.960000          95.260       92.2192
5     delta   6      84.826667          92.485       83.5792
6       eta   7      93.980000          97.300       95.6528
7   epsilon   8      60.788200          68.000       83.8672
8   foxtrot   9      94.306667          82.000       84.1472
9     gamma  10      96.406667          82.000       84.1472
10     geld  11      86.926667          92.485       82.7792
11    horus  12      78.173333          94.360       84.3200
12     iota  13      94.306667          82.000       84.1472
13     ixus  14      78.173333          94.360       84.3200
14  jakarta  15      84.826667          92.485       82.7792
15    koppa  16       0.000000          87.685       83.8672
16   lambda  17      93.980000          97.300       95.6528
17       mu  18      79.806667          83.500       81.2792
18       nu  19      75.406667          82.000       82.5472
19     neta  20      69.314000          87.685       50.3360
20  omicron  21      93.980000          97.300       95.6528
21    omega  22      79.806667          83.500       81.2792
22  phalanx  23      84.826667          92.485       82.7792
23     peta  24      94.960000          95.260       92.2192
24       pi  25      79.806667          87.460       81.2792
25    yotta  26      93.980000          97.300       94.8528
26     zeta  27      86.626667          84.850       83.8672

In [46]:
def get_grades_optimized(df):
  prelim = df["prelim_grades"]
  midterm = df["midterm_grades"]
  finals = df["final_grades"]
  df["semestral_grades"] = sem_grades = prelim * 0.3 + midterm * 0.3 + finals * 0.4
  return df

In [47]:
get_grades_optimized(newclassgrades_df)
newclassgrades_df

       name  id  prelim_grades  midterm_grades  final_grades  semestral_grades
0     alpha   1      94.960000          95.260       92.2192          93.95368
1     aleph   2      94.960000          95.260       92.7792          94.17768
2      beta   3      78.173333          94.360       84.3200          85.48800
3      beth   4      78.173333          81.372       84.6400          81.71960
4    cuprum   5      94.960000          95.260       92.2192          93.95368
5     delta   6      84.826667          92.485       83.5792          86.62518
6       eta   7      93.980000          97.300       95.6528          95.64512
7   epsilon   8      60.788200          68.000       83.8672          72.18334
8   foxtrot   9      94.306667          82.000       84.1472          86.55088
9     gamma  10      96.406667          82.000       84.1472          87.18088
10     geld  11      86.926667          92.485       82.7792          86.93518
11    horus  12      78.173333          94.360       84.3200          85.48800
12     iota  13      94.306667          82.000       84.1472          86.55088
13     ixus  14      78.173333          94.360       84.3200          85.48800
14  jakarta  15      84.826667          92.485       82.7792          86.30518
15    koppa  16       0.000000          87.685       83.8672          59.85238
16   lambda  17      93.980000          97.300       95.6528          95.64512
17       mu  18      79.806667          83.500       81.2792          81.50368
18       nu  19      75.406667          82.000       82.5472          80.24088
19     neta  20      69.314000          87.685       50.3360          67.23410
20  omicron  21      93.980000          97.300       95.6528          95.64512
21    omega  22      79.806667          83.500       81.2792          81.50368
22  phalanx  23      84.826667          92.485       82.7792          86.30518
23     peta  24      94.960000          95.260       92.2192          93.95368
24       pi  25      79.806667          87.460       81.2792          82.69168
25    yotta  26      93.980000          97.300       94.8528          95.32512
26     zeta  27      86.626667          84.850       83.8672          84.98988

In [ ]:
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)

In [48]:
column_name = ["Student_ID"]

classlists_df = pd.read_excel(r'/content/sample_data/classlists.xlsx', sheet_name=['class1','class2'])
classlists_df

{'class1':      201009754
 0    201109795
 1    201005713
 2    201009855
 3    201006171
 4    201103568
 ..         ...
 994  201108927
 995  201005697
 996  201005744
 997  201109959
 998  201109382

 [999 rows x 1 columns], 'class2':      201103056
 0    201105136
 1    201002284
 2    201104588
 3    201004799
 4    201005725
 ..         ...
 994  201101346
 995  201007625
 996  201003815
 997  201102428
 998  201006876

 [999 rows x 1 columns]}

In [49]:
classlists_df = pd.concat(pd.read_excel(r'/content/sample_data/classlists.xlsx', names=column_name, sheet_name=None), ignore_index=True)
classlists_df

      Student_ID
0      201109795
1      201005713
2      201009855
3      201006171
4      201103568
...          ...
1993   201101346
1994   201007625
1995   201003815
1996   201102428
1997   201006876

[1998 rows x 1 columns]

In [50]:
def get_similar_students(df):
  df_counts = df['Student_ID'].value_counts()
  df = pd.DataFrame(df_counts)
  return df

In [51]:
get_similar_students(classlists_df)

           Student_ID
201107845           3
201101893           3
201104795           3
201009820           3
201005482           2
...               ...
201108096           1
201007753           1
201001612           1
201007757           1
201005057           1

[1887 rows x 1 columns]

# 2. Some Object-Oriented Programming Concepts

Object-oriented programming (OOP) is undoubtedly a foundational programming course for Software Engineering. The idea of OOP is to transform procedural programming into a more modular programming style. In this section, we are going to review the fundamentals of OOP such as objects, classes, and encapsulation.

## 2.1 Objects and Classes
Learning about objects and classes is one of the foundations of OOP. Think of objects as any object that you could see. Like cars, shirts, humans, professions, even your favorite anime characters. Classes on the other hand are the categories or concepts of those things. In this section, we’ll review how to instantiate classes and objects.

### *Attributes and Methods*
Just like any object are just things we could describe them or they could have what we call descriptions or characteristics. In OOP we call these attributes. Attributes can be any value representing an aspect of the object which is inclusive to its concept of class. For example, a tree (object)  under the category of plants (class) could have attributes such as its name, age, height, or even the amount of oxygen it produces.

Methods, on the other hand, are interactions that could be done by the object or could be done onto the object. For example for our tree, it could grow, photosynthesize, absorb water, or we could harvest its fruits. In this example, we can try to review the attributes and methods of a class or object.

In [ ]:
'''
    CASE 4: Class of Classes

    For this section we are going to look at implementing the fundamentals of
    OOP for our class routines.
'''
class Section:
  def __init__(self, max_pop, class_list):
    self.max_pop = max_pop
    self.class_list = class_list
  
  def count_class(self):
    return len(self.class_list)

  def is_overloaded(self):
    is_overload = True if self.count_class() > self.max_pop else False
    return is_overload

### *Class Instantiation*
Now that we have created our class let’s try to put them to use in code. To use classes and objects in your code we are going to instantiate them. There are several ways to instantiate an object and we will be trying them out in this section.

In [ ]:
CpE_58053 = Section(40, ['John'])
print(CpE_58053.is_overloaded())
print(CpE_58053.count_class())

False

## 2.2 Encapsulation
The idea of incapsulation is to restrict users or developers from using or tampering with the internal attributes or methods of a class. This would be similar to using the private or public property in Java, C++, or C#. Python also enforces this in programming but in a different way. 

Not every procedure or transaction in a class should be shown to the users. We used the concept of encapsulation to solve this. In Python, all attributes, variables, or methods are public by default. In this section, we will see how to make methods and attributes private.

In [ ]:
class Section:
  def __init__(self, max_pop, class_list):
    self.max_pop = max_pop
    self.class_list = class_list
  
  def __count_class(self):
    return len(self.class_list)

  def is_overloaded(self):
    is_overload = True if self.__count_class() > self.max_pop else False
    return is_overload

In [ ]:
CpE_58054 = Section(2, ['Jeanne', 'Pietro', 'Dude'])
print(CpE_58054.is_overloaded())
print(CpE_58054.__count_class())

### Task 4: Class of Classes
1. Modify the `class` `Section` and integrate the functions from Tasks 1 to 3 as its methods. Make sure that the codes are optimized.
2. Create a `method` named `get_failed()` wherein it will create a list of all the failed students in the class.
3. Create a `method` named `fail_count()` wherein it will return the count of the failed students.

** **Note:** due to data privacy, the data privacy office has mandated your code to refrain from printing the student number and names of students. Their student numbers and names must be masked with asterisks.

In [60]:
import pandas as pd

class Section:
  def __init__(self, dataframe):
    self.dataframe = dataframe
  
  def get_grades(self):
    prelim = self.dataframe["prelim_grades"]
    midterm = self.dataframe["midterm_grades"]
    finals = self.dataframe["final_grades"]
    name = self.dataframe["name"]
    id = self.dataframe["id"]
    i = 0
    for string in name: 
      self.dataframe["semestral_grades"] = sem_grades = prelim * 0.3 + midterm * 0.3 + finals * 0.4
      self.dataframe.at[i, 'name'] = len(name[i]) * "*"
      self.dataframe["id"] = "*"
      i = i + 1
    
    return self.dataframe

  def get_class_stats(self):
    prelim = self.dataframe["prelim_grades"]
    midterm = self.dataframe["midterm_grades"]
    finals = self.dataframe["final_grades"]
    sem_grade = self.dataframe["semestral_grades"]

    p_mean = prelim.mean()
    p_median = prelim.median()
    p_mode = prelim.mode()[0]
    p_std = prelim.std()
    p_lowest = prelim.min()
    p_highest = prelim.max()

    m_mean =  midterm.mean()
    m_median =  midterm.median()
    m_mode =  midterm.mode()[0]
    m_std =  midterm.std()
    m_lowest = midterm.min()
    m_highest = midterm.max()

    f_mean = finals.mean()
    f_median = finals.median()
    f_mode = finals.mode()[0]
    f_std = finals.std()
    f_lowest = finals.min()
    f_highest = finals.max()

    s_mean = sem_grade.mean()
    s_median = sem_grade.median()
    s_mode = sem_grade.mode()[0]
    s_std = sem_grade.std()
    s_lowest = sem_grade.min()
    s_highest = sem_grade.max()

    classStats = {' ':["Prelim Grades","Midterm Grades","Final Grades","Semestral Grades"],
          'Lowest':[p_lowest,m_lowest,f_lowest,s_lowest],
          'Highest':[p_highest,m_highest,f_highest,s_highest],
          'Mean':[p_mean,m_mean,f_mean,s_mean],
          'Median':[p_median,m_median,f_median,s_median],
          'Mode':[p_mode,m_mode,f_mode,s_mode],
          'Standard_Deviation':[p_std,m_std,f_std,s_std]
    }
    self.dataframe = pd.DataFrame(classStats)
    return self.dataframe
  
  def get_similar_students(self):
    df_counts = self.dataframe['Student_ID'].value_counts()
    self.dataframe = pd.DataFrame(df_counts)
    return self.dataframe
  
  def get_failed(self):
    i = 0
    students_failed = []
    for grade in self.dataframe["semestral_grades"]:
      if grade < 70:
        students_failed.append(self.dataframe["name"][i])
      i=i+1
    return students_failed

  def fail_count(self):
    students_failed = []
    for grade in self.dataframe["semestral_grades"]:
      if grade < 70:
        students_failed.append(grade)
    self.dataframe = print("Count of students failed: ", len(students_failed))
    return self.dataframe



class_list1 = Section(newclassgrades_df)
class_list2 = Section(classlists_df)

In [52]:
class_list1.get_grades()

       name id  prelim_grades  midterm_grades  final_grades  semestral_grades
0     *****  *      94.960000          95.260       92.2192          93.95368
1     *****  *      94.960000          95.260       92.7792          94.17768
2      ****  *      78.173333          94.360       84.3200          85.48800
3      ****  *      78.173333          81.372       84.6400          81.71960
4    ******  *      94.960000          95.260       92.2192          93.95368
5     *****  *      84.826667          92.485       83.5792          86.62518
6       ***  *      93.980000          97.300       95.6528          95.64512
7   *******  *      60.788200          68.000       83.8672          72.18334
8   *******  *      94.306667          82.000       84.1472          86.55088
9     *****  *      96.406667          82.000       84.1472          87.18088
10     ****  *      86.926667          92.485       82.7792          86.93518
11    *****  *      78.173333          94.360       84.3200          85.48800
12     ****  *      94.306667          82.000       84.1472          86.55088
13     ****  *      78.173333          94.360       84.3200          85.48800
14  *******  *      84.826667          92.485       82.7792          86.30518
15    *****  *       0.000000          87.685       83.8672          59.85238
16   ******  *      93.980000          97.300       95.6528          95.64512
17       **  *      79.806667          83.500       81.2792          81.50368
18       **  *      75.406667          82.000       82.5472          80.24088
19     ****  *      69.314000          87.685       50.3360          67.23410
20  *******  *      93.980000          97.300       95.6528          95.64512
21    *****  *      79.806667          83.500       81.2792          81.50368
22  *******  *      84.826667          92.485       82.7792          86.30518
23     ****  *      94.960000          95.260       92.2192          93.95368
24       **  *      79.806667          87.460       81.2792          82.69168
25    *****  *      93.980000          97.300       94.8528          95.32512
26     ****  *      86.626667          84.850       83.8672          84.98988

In [53]:
class_list1.get_class_stats()

,,Lowest,Highest,Mean,Median,Mode,Standard_Deviation
0,Prelim Grades,0.00000,96.406667,82.460575,84.826667,78.173333,18.883918
1,Midterm Grades,68.00000,97.300000,89.456000,92.485000,82.000000,7.179578
2,Final Grades,50.33600,95.652800,85.241807,84.147200,81.279200,8.607503
3,Semestral Grades,59.85238,95.645120,85.671696,86.305180,85.488000,8.670630

In [61]:
class_list2.get_similar_students()
#No need to mask their ID's, only getting the similar students ID. if I asteris it all it will count (* 1998)

           Student_ID
201107845           3
201101893           3
201104795           3
201009820           3
201005482           2
...               ...
201108096           1
201007753           1
201001612           1
201007757           1
201005057           1

[1887 rows x 1 columns]

In [35]:
class_list1.get_failed()

['*****', '****']

In [62]:
#From its true identity (Just to corfirm if the program runs correct thanks :D)
Section(classgrades_df).get_failed()

['koppa', 'neta']

In [63]:
class_list1.fail_count()

Count of students failed:  2



---
**END OF LABORATORY**

---